###############################################################
#  Generated by:      Cadence Innovus 20.12-s088_1
#  OS:                Linux x86_64(Host ID atlas)
#  Generated on:      Sun Nov  2 12:57:34 2025
#  Design:            MCU
#  Command:           saveDesign dbs/MCU.signoff.innovus -def -netlist -rc -tcon
###############################################################
current_design MCU
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_pins {spi0/sck_in}]  -name clk_sck0 -period 28.571430 -waveform {0.000000 14.285715}
create_clock [get_pins {system0/mclk_out}]  -name mclk -period 28.571430 -waveform {0.000000 14.285715}
create_clock [get_pins {spi1/sck_in}]  -name clk_sck1 -period 28.571430 -waveform {0.000000 14.285715}
create_clock [get_pins {system0/clk_lfxt_out}]  -name clk_lfxt -period 30517.578000 -waveform {0.000000 15258.789000}
create_clock [get_pins {i2c0/SCL_IN}]  -name clk_scl0 -period 200.000000 -waveform {0.000000 100.000000}
create_clock [get_pins {core/clk_cpu}]  -name clk_cpu -period 28.571430 -waveform {0.000000 14.285715}
create_clock [get_pins {i2c1/SCL_IN}]  -name clk_scl1 -period 200.000000 -waveform {0.000000 100.000000}
create_clock [get_pins {system0/smclk_out}]  -name smclk -period 28.571430 -waveform {0.000000 14.285715}
create_clock [get_pins {system0/clk_hfxt_out}]  -name clk_hfxt -period 28.571430 -waveform {0.000000 14.285715}
set_propagated_clock  [get_pins {core/clk_cpu}]
set_propagated_clock  [get_pins {system0/clk_lfxt_out}]
set_propagated_clock  [get_pins {i2c0/SCL_IN}]
set_propagated_clock  [get_pins {i2c1/SCL_IN}]
set_propagated_clock  [get_pins {system0/smclk_out}]
set_propagated_clock  [get_pins {system0/clk_hfxt_out}]
set_propagated_clock  [get_pins {spi0/sck_in}]
set_propagated_clock  [get_pins {system0/mclk_out}]
set_propagated_clock  [get_pins {spi1/sck_in}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -min -pin Y [get_ports {resetn_in}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -min -pin Y [get_ports {resetn_in}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -max -pin Y [get_ports {resetn_in}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -max -pin Y [get_ports {resetn_in}]
set_load -pin_load -max  0.6  [get_ports {resetn_out}]
set_load -pin_load -min  0.6  [get_ports {resetn_out}]
set_load -pin_load -max  0.6  [get_ports {resetn_dir}]
set_load -pin_load -min  0.6  [get_ports {resetn_dir}]
set_load -pin_load -max  0.6  [get_ports {resetn_ren}]
set_load -pin_load -min  0.6  [get_ports {resetn_ren}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -min -pin Y [get_ports {prt1_in[7]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -min -pin Y [get_ports {prt1_in[7]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -max -pin Y [get_ports {prt1_in[7]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -max -pin Y [get_ports {prt1_in[7]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -min -pin Y [get_ports {prt1_in[6]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -min -pin Y [get_ports {prt1_in[6]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -max -pin Y [get_ports {prt1_in[6]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -max -pin Y [get_ports {prt1_in[6]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -min -pin Y [get_ports {prt1_in[5]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -min -pin Y [get_ports {prt1_in[5]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -max -pin Y [get_ports {prt1_in[5]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -max -pin Y [get_ports {prt1_in[5]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -min -pin Y [get_ports {prt1_in[4]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -min -pin Y [get_ports {prt1_in[4]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -max -pin Y [get_ports {prt1_in[4]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -max -pin Y [get_ports {prt1_in[4]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -min -pin Y [get_ports {prt1_in[3]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -min -pin Y [get_ports {prt1_in[3]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -max -pin Y [get_ports {prt1_in[3]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -max -pin Y [get_ports {prt1_in[3]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -min -pin Y [get_ports {prt1_in[2]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -min -pin Y [get_ports {prt1_in[2]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -max -pin Y [get_ports {prt1_in[2]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -max -pin Y [get_ports {prt1_in[2]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -min -pin Y [get_ports {prt1_in[1]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -min -pin Y [get_ports {prt1_in[1]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -max -pin Y [get_ports {prt1_in[1]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -max -pin Y [get_ports {prt1_in[1]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -min -pin Y [get_ports {prt1_in[0]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -min -pin Y [get_ports {prt1_in[0]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -max -pin Y [get_ports {prt1_in[0]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -max -pin Y [get_ports {prt1_in[0]}]
set_load -pin_load -max  0.6  [get_ports {prt1_out[7]}]
set_load -pin_load -min  0.6  [get_ports {prt1_out[7]}]
set_load -pin_load -max  0.6  [get_ports {prt1_out[6]}]
set_load -pin_load -min  0.6  [get_ports {prt1_out[6]}]
set_load -pin_load -max  0.6  [get_ports {prt1_out[5]}]
set_load -pin_load -min  0.6  [get_ports {prt1_out[5]}]
set_load -pin_load -max  0.6  [get_ports {prt1_out[4]}]
set_load -pin_load -min  0.6  [get_ports {prt1_out[4]}]
set_load -pin_load -max  0.6  [get_ports {prt1_out[3]}]
set_load -pin_load -min  0.6  [get_ports {prt1_out[3]}]
set_load -pin_load -max  0.6  [get_ports {prt1_out[2]}]
set_load -pin_load -min  0.6  [get_ports {prt1_out[2]}]
set_load -pin_load -max  0.6  [get_ports {prt1_out[1]}]
set_load -pin_load -min  0.6  [get_ports {prt1_out[1]}]
set_load -pin_load -max  0.6  [get_ports {prt1_out[0]}]
set_load -pin_load -min  0.6  [get_ports {prt1_out[0]}]
set_load -pin_load -max  0.6  [get_ports {prt1_dir[7]}]
set_load -pin_load -min  0.6  [get_ports {prt1_dir[7]}]
set_load -pin_load -max  0.6  [get_ports {prt1_dir[6]}]
set_load -pin_load -min  0.6  [get_ports {prt1_dir[6]}]
set_load -pin_load -max  0.6  [get_ports {prt1_dir[5]}]
set_load -pin_load -min  0.6  [get_ports {prt1_dir[5]}]
set_load -pin_load -max  0.6  [get_ports {prt1_dir[4]}]
set_load -pin_load -min  0.6  [get_ports {prt1_dir[4]}]
set_load -pin_load -max  0.6  [get_ports {prt1_dir[3]}]
set_load -pin_load -min  0.6  [get_ports {prt1_dir[3]}]
set_load -pin_load -max  0.6  [get_ports {prt1_dir[2]}]
set_load -pin_load -min  0.6  [get_ports {prt1_dir[2]}]
set_load -pin_load -max  0.6  [get_ports {prt1_dir[1]}]
set_load -pin_load -min  0.6  [get_ports {prt1_dir[1]}]
set_load -pin_load -max  0.6  [get_ports {prt1_dir[0]}]
set_load -pin_load -min  0.6  [get_ports {prt1_dir[0]}]
set_load -pin_load -max  0.6  [get_ports {prt1_ren[7]}]
set_load -pin_load -min  0.6  [get_ports {prt1_ren[7]}]
set_load -pin_load -max  0.6  [get_ports {prt1_ren[6]}]
set_load -pin_load -min  0.6  [get_ports {prt1_ren[6]}]
set_load -pin_load -max  0.6  [get_ports {prt1_ren[5]}]
set_load -pin_load -min  0.6  [get_ports {prt1_ren[5]}]
set_load -pin_load -max  0.6  [get_ports {prt1_ren[4]}]
set_load -pin_load -min  0.6  [get_ports {prt1_ren[4]}]
set_load -pin_load -max  0.6  [get_ports {prt1_ren[3]}]
set_load -pin_load -min  0.6  [get_ports {prt1_ren[3]}]
set_load -pin_load -max  0.6  [get_ports {prt1_ren[2]}]
set_load -pin_load -min  0.6  [get_ports {prt1_ren[2]}]
set_load -pin_load -max  0.6  [get_ports {prt1_ren[1]}]
set_load -pin_load -min  0.6  [get_ports {prt1_ren[1]}]
set_load -pin_load -max  0.6  [get_ports {prt1_ren[0]}]
set_load -pin_load -min  0.6  [get_ports {prt1_ren[0]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -min -pin Y [get_ports {prt2_in[7]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -min -pin Y [get_ports {prt2_in[7]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -max -pin Y [get_ports {prt2_in[7]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -max -pin Y [get_ports {prt2_in[7]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -min -pin Y [get_ports {prt2_in[6]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -min -pin Y [get_ports {prt2_in[6]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -max -pin Y [get_ports {prt2_in[6]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -max -pin Y [get_ports {prt2_in[6]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -min -pin Y [get_ports {prt2_in[5]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -min -pin Y [get_ports {prt2_in[5]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -max -pin Y [get_ports {prt2_in[5]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -max -pin Y [get_ports {prt2_in[5]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -min -pin Y [get_ports {prt2_in[4]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -min -pin Y [get_ports {prt2_in[4]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -max -pin Y [get_ports {prt2_in[4]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -max -pin Y [get_ports {prt2_in[4]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -min -pin Y [get_ports {prt2_in[3]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -min -pin Y [get_ports {prt2_in[3]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -max -pin Y [get_ports {prt2_in[3]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -max -pin Y [get_ports {prt2_in[3]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -min -pin Y [get_ports {prt2_in[2]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -min -pin Y [get_ports {prt2_in[2]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -max -pin Y [get_ports {prt2_in[2]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -max -pin Y [get_ports {prt2_in[2]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -min -pin Y [get_ports {prt2_in[1]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -min -pin Y [get_ports {prt2_in[1]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -max -pin Y [get_ports {prt2_in[1]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -max -pin Y [get_ports {prt2_in[1]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -min -pin Y [get_ports {prt2_in[0]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -min -pin Y [get_ports {prt2_in[0]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -max -pin Y [get_ports {prt2_in[0]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -max -pin Y [get_ports {prt2_in[0]}]
set_load -pin_load -max  0.6  [get_ports {prt2_out[7]}]
set_load -pin_load -min  0.6  [get_ports {prt2_out[7]}]
set_load -pin_load -max  0.6  [get_ports {prt2_out[6]}]
set_load -pin_load -min  0.6  [get_ports {prt2_out[6]}]
set_load -pin_load -max  0.6  [get_ports {prt2_out[5]}]
set_load -pin_load -min  0.6  [get_ports {prt2_out[5]}]
set_load -pin_load -max  0.6  [get_ports {prt2_out[4]}]
set_load -pin_load -min  0.6  [get_ports {prt2_out[4]}]
set_load -pin_load -max  0.6  [get_ports {prt2_out[3]}]
set_load -pin_load -min  0.6  [get_ports {prt2_out[3]}]
set_load -pin_load -max  0.6  [get_ports {prt2_out[2]}]
set_load -pin_load -min  0.6  [get_ports {prt2_out[2]}]
set_load -pin_load -max  0.6  [get_ports {prt2_out[1]}]
set_load -pin_load -min  0.6  [get_ports {prt2_out[1]}]
set_load -pin_load -max  0.6  [get_ports {prt2_out[0]}]
set_load -pin_load -min  0.6  [get_ports {prt2_out[0]}]
set_load -pin_load -max  0.6  [get_ports {prt2_dir[7]}]
set_load -pin_load -min  0.6  [get_ports {prt2_dir[7]}]
set_load -pin_load -max  0.6  [get_ports {prt2_dir[6]}]
set_load -pin_load -min  0.6  [get_ports {prt2_dir[6]}]
set_load -pin_load -max  0.6  [get_ports {prt2_dir[5]}]
set_load -pin_load -min  0.6  [get_ports {prt2_dir[5]}]
set_load -pin_load -max  0.6  [get_ports {prt2_dir[4]}]
set_load -pin_load -min  0.6  [get_ports {prt2_dir[4]}]
set_load -pin_load -max  0.6  [get_ports {prt2_dir[3]}]
set_load -pin_load -min  0.6  [get_ports {prt2_dir[3]}]
set_load -pin_load -max  0.6  [get_ports {prt2_dir[2]}]
set_load -pin_load -min  0.6  [get_ports {prt2_dir[2]}]
set_load -pin_load -max  0.6  [get_ports {prt2_dir[1]}]
set_load -pin_load -min  0.6  [get_ports {prt2_dir[1]}]
set_load -pin_load -max  0.6  [get_ports {prt2_dir[0]}]
set_load -pin_load -min  0.6  [get_ports {prt2_dir[0]}]
set_load -pin_load -max  0.6  [get_ports {prt2_ren[7]}]
set_load -pin_load -min  0.6  [get_ports {prt2_ren[7]}]
set_load -pin_load -max  0.6  [get_ports {prt2_ren[6]}]
set_load -pin_load -min  0.6  [get_ports {prt2_ren[6]}]
set_load -pin_load -max  0.6  [get_ports {prt2_ren[5]}]
set_load -pin_load -min  0.6  [get_ports {prt2_ren[5]}]
set_load -pin_load -max  0.6  [get_ports {prt2_ren[4]}]
set_load -pin_load -min  0.6  [get_ports {prt2_ren[4]}]
set_load -pin_load -max  0.6  [get_ports {prt2_ren[3]}]
set_load -pin_load -min  0.6  [get_ports {prt2_ren[3]}]
set_load -pin_load -max  0.6  [get_ports {prt2_ren[2]}]
set_load -pin_load -min  0.6  [get_ports {prt2_ren[2]}]
set_load -pin_load -max  0.6  [get_ports {prt2_ren[1]}]
set_load -pin_load -min  0.6  [get_ports {prt2_ren[1]}]
set_load -pin_load -max  0.6  [get_ports {prt2_ren[0]}]
set_load -pin_load -min  0.6  [get_ports {prt2_ren[0]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -min -pin Y [get_ports {prt3_in[7]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -min -pin Y [get_ports {prt3_in[7]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -max -pin Y [get_ports {prt3_in[7]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -max -pin Y [get_ports {prt3_in[7]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -min -pin Y [get_ports {prt3_in[6]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -min -pin Y [get_ports {prt3_in[6]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -max -pin Y [get_ports {prt3_in[6]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -max -pin Y [get_ports {prt3_in[6]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -min -pin Y [get_ports {prt3_in[5]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -min -pin Y [get_ports {prt3_in[5]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -max -pin Y [get_ports {prt3_in[5]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -max -pin Y [get_ports {prt3_in[5]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -min -pin Y [get_ports {prt3_in[4]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -min -pin Y [get_ports {prt3_in[4]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -max -pin Y [get_ports {prt3_in[4]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -max -pin Y [get_ports {prt3_in[4]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -min -pin Y [get_ports {prt3_in[3]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -min -pin Y [get_ports {prt3_in[3]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -max -pin Y [get_ports {prt3_in[3]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -max -pin Y [get_ports {prt3_in[3]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -min -pin Y [get_ports {prt3_in[2]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -min -pin Y [get_ports {prt3_in[2]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -max -pin Y [get_ports {prt3_in[2]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -max -pin Y [get_ports {prt3_in[2]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -min -pin Y [get_ports {prt3_in[1]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -min -pin Y [get_ports {prt3_in[1]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -max -pin Y [get_ports {prt3_in[1]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -max -pin Y [get_ports {prt3_in[1]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -min -pin Y [get_ports {prt3_in[0]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -min -pin Y [get_ports {prt3_in[0]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -max -pin Y [get_ports {prt3_in[0]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -max -pin Y [get_ports {prt3_in[0]}]
set_load -pin_load -max  0.6  [get_ports {prt3_out[7]}]
set_load -pin_load -min  0.6  [get_ports {prt3_out[7]}]
set_load -pin_load -max  0.6  [get_ports {prt3_out[6]}]
set_load -pin_load -min  0.6  [get_ports {prt3_out[6]}]
set_load -pin_load -max  0.6  [get_ports {prt3_out[5]}]
set_load -pin_load -min  0.6  [get_ports {prt3_out[5]}]
set_load -pin_load -max  0.6  [get_ports {prt3_out[4]}]
set_load -pin_load -min  0.6  [get_ports {prt3_out[4]}]
set_load -pin_load -max  0.6  [get_ports {prt3_out[3]}]
set_load -pin_load -min  0.6  [get_ports {prt3_out[3]}]
set_load -pin_load -max  0.6  [get_ports {prt3_out[2]}]
set_load -pin_load -min  0.6  [get_ports {prt3_out[2]}]
set_load -pin_load -max  0.6  [get_ports {prt3_out[1]}]
set_load -pin_load -min  0.6  [get_ports {prt3_out[1]}]
set_load -pin_load -max  0.6  [get_ports {prt3_out[0]}]
set_load -pin_load -min  0.6  [get_ports {prt3_out[0]}]
set_load -pin_load -max  0.6  [get_ports {prt3_dir[7]}]
set_load -pin_load -min  0.6  [get_ports {prt3_dir[7]}]
set_load -pin_load -max  0.6  [get_ports {prt3_dir[6]}]
set_load -pin_load -min  0.6  [get_ports {prt3_dir[6]}]
set_load -pin_load -max  0.6  [get_ports {prt3_dir[5]}]
set_load -pin_load -min  0.6  [get_ports {prt3_dir[5]}]
set_load -pin_load -max  0.6  [get_ports {prt3_dir[4]}]
set_load -pin_load -min  0.6  [get_ports {prt3_dir[4]}]
set_load -pin_load -max  0.6  [get_ports {prt3_dir[3]}]
set_load -pin_load -min  0.6  [get_ports {prt3_dir[3]}]
set_load -pin_load -max  0.6  [get_ports {prt3_dir[2]}]
set_load -pin_load -min  0.6  [get_ports {prt3_dir[2]}]
set_load -pin_load -max  0.6  [get_ports {prt3_dir[1]}]
set_load -pin_load -min  0.6  [get_ports {prt3_dir[1]}]
set_load -pin_load -max  0.6  [get_ports {prt3_dir[0]}]
set_load -pin_load -min  0.6  [get_ports {prt3_dir[0]}]
set_load -pin_load -max  0.6  [get_ports {prt3_ren[7]}]
set_load -pin_load -min  0.6  [get_ports {prt3_ren[7]}]
set_load -pin_load -max  0.6  [get_ports {prt3_ren[6]}]
set_load -pin_load -min  0.6  [get_ports {prt3_ren[6]}]
set_load -pin_load -max  0.6  [get_ports {prt3_ren[5]}]
set_load -pin_load -min  0.6  [get_ports {prt3_ren[5]}]
set_load -pin_load -max  0.6  [get_ports {prt3_ren[4]}]
set_load -pin_load -min  0.6  [get_ports {prt3_ren[4]}]
set_load -pin_load -max  0.6  [get_ports {prt3_ren[3]}]
set_load -pin_load -min  0.6  [get_ports {prt3_ren[3]}]
set_load -pin_load -max  0.6  [get_ports {prt3_ren[2]}]
set_load -pin_load -min  0.6  [get_ports {prt3_ren[2]}]
set_load -pin_load -max  0.6  [get_ports {prt3_ren[1]}]
set_load -pin_load -min  0.6  [get_ports {prt3_ren[1]}]
set_load -pin_load -max  0.6  [get_ports {prt3_ren[0]}]
set_load -pin_load -min  0.6  [get_ports {prt3_ren[0]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -min -pin Y [get_ports {prt4_in[7]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -min -pin Y [get_ports {prt4_in[7]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -max -pin Y [get_ports {prt4_in[7]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -max -pin Y [get_ports {prt4_in[7]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -min -pin Y [get_ports {prt4_in[6]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -min -pin Y [get_ports {prt4_in[6]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -max -pin Y [get_ports {prt4_in[6]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -max -pin Y [get_ports {prt4_in[6]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -min -pin Y [get_ports {prt4_in[5]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -min -pin Y [get_ports {prt4_in[5]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -max -pin Y [get_ports {prt4_in[5]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -max -pin Y [get_ports {prt4_in[5]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -min -pin Y [get_ports {prt4_in[4]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -min -pin Y [get_ports {prt4_in[4]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -max -pin Y [get_ports {prt4_in[4]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -max -pin Y [get_ports {prt4_in[4]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -min -pin Y [get_ports {prt4_in[3]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -min -pin Y [get_ports {prt4_in[3]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -max -pin Y [get_ports {prt4_in[3]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -max -pin Y [get_ports {prt4_in[3]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -min -pin Y [get_ports {prt4_in[2]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -min -pin Y [get_ports {prt4_in[2]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -max -pin Y [get_ports {prt4_in[2]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -max -pin Y [get_ports {prt4_in[2]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -min -pin Y [get_ports {prt4_in[1]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -min -pin Y [get_ports {prt4_in[1]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -max -pin Y [get_ports {prt4_in[1]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -max -pin Y [get_ports {prt4_in[1]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -min -pin Y [get_ports {prt4_in[0]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -min -pin Y [get_ports {prt4_in[0]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -max -pin Y [get_ports {prt4_in[0]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -max -pin Y [get_ports {prt4_in[0]}]
set_load -pin_load -max  0.6  [get_ports {prt4_out[7]}]
set_load -pin_load -min  0.6  [get_ports {prt4_out[7]}]
set_load -pin_load -max  0.6  [get_ports {prt4_out[6]}]
set_load -pin_load -min  0.6  [get_ports {prt4_out[6]}]
set_load -pin_load -max  0.6  [get_ports {prt4_out[5]}]
set_load -pin_load -min  0.6  [get_ports {prt4_out[5]}]
set_load -pin_load -max  0.6  [get_ports {prt4_out[4]}]
set_load -pin_load -min  0.6  [get_ports {prt4_out[4]}]
set_load -pin_load -max  0.6  [get_ports {prt4_out[3]}]
set_load -pin_load -min  0.6  [get_ports {prt4_out[3]}]
set_load -pin_load -max  0.6  [get_ports {prt4_out[2]}]
set_load -pin_load -min  0.6  [get_ports {prt4_out[2]}]
set_load -pin_load -max  0.6  [get_ports {prt4_out[1]}]
set_load -pin_load -min  0.6  [get_ports {prt4_out[1]}]
set_load -pin_load -max  0.6  [get_ports {prt4_out[0]}]
set_load -pin_load -min  0.6  [get_ports {prt4_out[0]}]
set_load -pin_load -max  0.6  [get_ports {prt4_dir[7]}]
set_load -pin_load -min  0.6  [get_ports {prt4_dir[7]}]
set_load -pin_load -max  0.6  [get_ports {prt4_dir[6]}]
set_load -pin_load -min  0.6  [get_ports {prt4_dir[6]}]
set_load -pin_load -max  0.6  [get_ports {prt4_dir[5]}]
set_load -pin_load -min  0.6  [get_ports {prt4_dir[5]}]
set_load -pin_load -max  0.6  [get_ports {prt4_dir[4]}]
set_load -pin_load -min  0.6  [get_ports {prt4_dir[4]}]
set_load -pin_load -max  0.6  [get_ports {prt4_dir[3]}]
set_load -pin_load -min  0.6  [get_ports {prt4_dir[3]}]
set_load -pin_load -max  0.6  [get_ports {prt4_dir[2]}]
set_load -pin_load -min  0.6  [get_ports {prt4_dir[2]}]
set_load -pin_load -max  0.6  [get_ports {prt4_dir[1]}]
set_load -pin_load -min  0.6  [get_ports {prt4_dir[1]}]
set_load -pin_load -max  0.6  [get_ports {prt4_dir[0]}]
set_load -pin_load -min  0.6  [get_ports {prt4_dir[0]}]
set_load -pin_load -max  0.6  [get_ports {prt4_ren[7]}]
set_load -pin_load -min  0.6  [get_ports {prt4_ren[7]}]
set_load -pin_load -max  0.6  [get_ports {prt4_ren[6]}]
set_load -pin_load -min  0.6  [get_ports {prt4_ren[6]}]
set_load -pin_load -max  0.6  [get_ports {prt4_ren[5]}]
set_load -pin_load -min  0.6  [get_ports {prt4_ren[5]}]
set_load -pin_load -max  0.6  [get_ports {prt4_ren[4]}]
set_load -pin_load -min  0.6  [get_ports {prt4_ren[4]}]
set_load -pin_load -max  0.6  [get_ports {prt4_ren[3]}]
set_load -pin_load -min  0.6  [get_ports {prt4_ren[3]}]
set_load -pin_load -max  0.6  [get_ports {prt4_ren[2]}]
set_load -pin_load -min  0.6  [get_ports {prt4_ren[2]}]
set_load -pin_load -max  0.6  [get_ports {prt4_ren[1]}]
set_load -pin_load -min  0.6  [get_ports {prt4_ren[1]}]
set_load -pin_load -max  0.6  [get_ports {prt4_ren[0]}]
set_load -pin_load -min  0.6  [get_ports {prt4_ren[0]}]
set_load -pin_load -max  0.6  [get_ports {use_dac_glb_bias}]
set_load -pin_load -min  0.6  [get_ports {use_dac_glb_bias}]
set_load -pin_load -max  0.6  [get_ports {en_bias_buf}]
set_load -pin_load -min  0.6  [get_ports {en_bias_buf}]
set_load -pin_load -max  0.6  [get_ports {en_bias_gen}]
set_load -pin_load -min  0.6  [get_ports {en_bias_gen}]
set_load -pin_load -max  0.6  [get_ports {BIAS_ADJ[5]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_ADJ[5]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_ADJ[4]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_ADJ[4]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_ADJ[3]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_ADJ[3]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_ADJ[2]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_ADJ[2]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_ADJ[1]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_ADJ[1]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_ADJ[0]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_ADJ[0]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBP[13]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBP[13]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBP[12]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBP[12]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBP[11]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBP[11]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBP[10]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBP[10]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBP[9]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBP[9]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBP[8]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBP[8]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBP[7]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBP[7]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBP[6]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBP[6]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBP[5]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBP[5]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBP[4]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBP[4]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBP[3]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBP[3]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBP[2]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBP[2]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBP[1]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBP[1]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBP[0]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBP[0]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBN[13]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBN[13]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBN[12]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBN[12]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBN[11]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBN[11]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBN[10]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBN[10]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBN[9]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBN[9]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBN[8]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBN[8]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBN[7]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBN[7]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBN[6]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBN[6]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBN[5]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBN[5]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBN[4]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBN[4]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBN[3]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBN[3]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBN[2]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBN[2]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBN[1]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBN[1]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBN[0]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBN[0]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBPC[13]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBPC[13]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBPC[12]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBPC[12]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBPC[11]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBPC[11]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBPC[10]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBPC[10]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBPC[9]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBPC[9]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBPC[8]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBPC[8]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBPC[7]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBPC[7]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBPC[6]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBPC[6]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBPC[5]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBPC[5]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBPC[4]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBPC[4]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBPC[3]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBPC[3]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBPC[2]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBPC[2]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBPC[1]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBPC[1]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBPC[0]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBPC[0]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBNC[13]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBNC[13]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBNC[12]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBNC[12]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBNC[11]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBNC[11]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBNC[10]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBNC[10]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBNC[9]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBNC[9]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBNC[8]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBNC[8]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBNC[7]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBNC[7]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBNC[6]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBNC[6]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBNC[5]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBNC[5]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBNC[4]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBNC[4]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBNC[3]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBNC[3]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBNC[2]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBNC[2]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBNC[1]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBNC[1]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DBNC[0]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DBNC[0]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_TC_POT[5]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_TC_POT[5]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_TC_POT[4]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_TC_POT[4]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_TC_POT[3]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_TC_POT[3]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_TC_POT[2]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_TC_POT[2]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_TC_POT[1]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_TC_POT[1]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_TC_POT[0]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_TC_POT[0]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_LC_POT[5]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_LC_POT[5]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_LC_POT[4]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_LC_POT[4]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_LC_POT[3]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_LC_POT[3]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_LC_POT[2]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_LC_POT[2]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_LC_POT[1]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_LC_POT[1]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_LC_POT[0]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_LC_POT[0]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_TIA_G_POT[15]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_TIA_G_POT[15]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_TIA_G_POT[14]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_TIA_G_POT[14]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_TIA_G_POT[13]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_TIA_G_POT[13]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_TIA_G_POT[12]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_TIA_G_POT[12]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_TIA_G_POT[11]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_TIA_G_POT[11]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_TIA_G_POT[10]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_TIA_G_POT[10]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_TIA_G_POT[9]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_TIA_G_POT[9]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_TIA_G_POT[8]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_TIA_G_POT[8]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_TIA_G_POT[7]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_TIA_G_POT[7]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_TIA_G_POT[6]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_TIA_G_POT[6]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_TIA_G_POT[5]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_TIA_G_POT[5]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_TIA_G_POT[4]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_TIA_G_POT[4]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_TIA_G_POT[3]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_TIA_G_POT[3]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_TIA_G_POT[2]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_TIA_G_POT[2]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_TIA_G_POT[1]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_TIA_G_POT[1]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_TIA_G_POT[0]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_TIA_G_POT[0]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_REV_POT[13]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_REV_POT[13]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_REV_POT[12]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_REV_POT[12]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_REV_POT[11]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_REV_POT[11]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_REV_POT[10]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_REV_POT[10]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_REV_POT[9]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_REV_POT[9]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_REV_POT[8]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_REV_POT[8]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_REV_POT[7]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_REV_POT[7]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_REV_POT[6]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_REV_POT[6]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_REV_POT[5]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_REV_POT[5]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_REV_POT[4]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_REV_POT[4]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_REV_POT[3]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_REV_POT[3]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_REV_POT[2]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_REV_POT[2]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_REV_POT[1]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_REV_POT[1]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_REV_POT[0]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_REV_POT[0]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_TC_DSADC[5]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_TC_DSADC[5]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_TC_DSADC[4]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_TC_DSADC[4]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_TC_DSADC[3]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_TC_DSADC[3]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_TC_DSADC[2]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_TC_DSADC[2]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_TC_DSADC[1]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_TC_DSADC[1]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_TC_DSADC[0]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_TC_DSADC[0]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_LC_DSADC[5]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_LC_DSADC[5]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_LC_DSADC[4]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_LC_DSADC[4]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_LC_DSADC[3]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_LC_DSADC[3]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_LC_DSADC[2]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_LC_DSADC[2]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_LC_DSADC[1]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_LC_DSADC[1]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_LC_DSADC[0]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_LC_DSADC[0]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_RIN_DSADC[5]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_RIN_DSADC[5]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_RIN_DSADC[4]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_RIN_DSADC[4]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_RIN_DSADC[3]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_RIN_DSADC[3]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_RIN_DSADC[2]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_RIN_DSADC[2]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_RIN_DSADC[1]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_RIN_DSADC[1]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_RIN_DSADC[0]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_RIN_DSADC[0]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_RFB_DSADC[5]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_RFB_DSADC[5]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_RFB_DSADC[4]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_RFB_DSADC[4]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_RFB_DSADC[3]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_RFB_DSADC[3]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_RFB_DSADC[2]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_RFB_DSADC[2]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_RFB_DSADC[1]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_RFB_DSADC[1]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_RFB_DSADC[0]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_RFB_DSADC[0]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DSADC_VCM[13]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DSADC_VCM[13]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DSADC_VCM[12]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DSADC_VCM[12]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DSADC_VCM[11]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DSADC_VCM[11]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DSADC_VCM[10]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DSADC_VCM[10]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DSADC_VCM[9]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DSADC_VCM[9]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DSADC_VCM[8]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DSADC_VCM[8]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DSADC_VCM[7]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DSADC_VCM[7]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DSADC_VCM[6]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DSADC_VCM[6]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DSADC_VCM[5]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DSADC_VCM[5]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DSADC_VCM[4]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DSADC_VCM[4]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DSADC_VCM[3]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DSADC_VCM[3]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DSADC_VCM[2]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DSADC_VCM[2]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DSADC_VCM[1]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DSADC_VCM[1]}]
set_load -pin_load -max  0.6  [get_ports {BIAS_DSADC_VCM[0]}]
set_load -pin_load -min  0.6  [get_ports {BIAS_DSADC_VCM[0]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -min -pin Y [get_ports {dsadc_conv_done}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -min -pin Y [get_ports {dsadc_conv_done}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -max -pin Y [get_ports {dsadc_conv_done}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -max -pin Y [get_ports {dsadc_conv_done}]
set_load -pin_load -max  0.6  [get_ports {dsadc_en}]
set_load -pin_load -min  0.6  [get_ports {dsadc_en}]
set_load -pin_load -max  0.6  [get_ports {dsadc_clk}]
set_load -pin_load -min  0.6  [get_ports {dsadc_clk}]
set_load -pin_load -max  0.6  [get_ports {dsadc_switch[2]}]
set_load -pin_load -min  0.6  [get_ports {dsadc_switch[2]}]
set_load -pin_load -max  0.6  [get_ports {dsadc_switch[1]}]
set_load -pin_load -min  0.6  [get_ports {dsadc_switch[1]}]
set_load -pin_load -max  0.6  [get_ports {dsadc_switch[0]}]
set_load -pin_load -min  0.6  [get_ports {dsadc_switch[0]}]
set_load -pin_load -max  0.6  [get_ports {dac_en_pot}]
set_load -pin_load -min  0.6  [get_ports {dac_en_pot}]
set_load -pin_load -max  0.6  [get_ports {adc_ext_in}]
set_load -pin_load -min  0.6  [get_ports {adc_ext_in}]
set_load -pin_load -max  0.6  [get_ports {atp_en}]
set_load -pin_load -min  0.6  [get_ports {atp_en}]
set_load -pin_load -max  0.6  [get_ports {atp_sel}]
set_load -pin_load -min  0.6  [get_ports {atp_sel}]
set_load -pin_load -max  0.6  [get_ports {adc_sel}]
set_load -pin_load -min  0.6  [get_ports {adc_sel}]
set_load -pin_load -max  0.6  [get_ports {saradc_clk}]
set_load -pin_load -min  0.6  [get_ports {saradc_clk}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -min -pin Y [get_ports {saradc_rdy}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -min -pin Y [get_ports {saradc_rdy}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -max -pin Y [get_ports {saradc_rdy}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -max -pin Y [get_ports {saradc_rdy}]
set_load -pin_load -max  0.6  [get_ports {saradc_rst}]
set_load -pin_load -min  0.6  [get_ports {saradc_rst}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -min -pin Y [get_ports {saradc_data[9]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -min -pin Y [get_ports {saradc_data[9]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -max -pin Y [get_ports {saradc_data[9]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -max -pin Y [get_ports {saradc_data[9]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -min -pin Y [get_ports {saradc_data[8]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -min -pin Y [get_ports {saradc_data[8]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -max -pin Y [get_ports {saradc_data[8]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -max -pin Y [get_ports {saradc_data[8]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -min -pin Y [get_ports {saradc_data[7]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -min -pin Y [get_ports {saradc_data[7]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -max -pin Y [get_ports {saradc_data[7]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -max -pin Y [get_ports {saradc_data[7]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -min -pin Y [get_ports {saradc_data[6]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -min -pin Y [get_ports {saradc_data[6]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -max -pin Y [get_ports {saradc_data[6]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -max -pin Y [get_ports {saradc_data[6]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -min -pin Y [get_ports {saradc_data[5]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -min -pin Y [get_ports {saradc_data[5]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -max -pin Y [get_ports {saradc_data[5]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -max -pin Y [get_ports {saradc_data[5]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -min -pin Y [get_ports {saradc_data[4]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -min -pin Y [get_ports {saradc_data[4]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -max -pin Y [get_ports {saradc_data[4]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -max -pin Y [get_ports {saradc_data[4]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -min -pin Y [get_ports {saradc_data[3]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -min -pin Y [get_ports {saradc_data[3]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -max -pin Y [get_ports {saradc_data[3]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -max -pin Y [get_ports {saradc_data[3]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -min -pin Y [get_ports {saradc_data[2]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -min -pin Y [get_ports {saradc_data[2]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -max -pin Y [get_ports {saradc_data[2]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -max -pin Y [get_ports {saradc_data[2]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -min -pin Y [get_ports {saradc_data[1]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -min -pin Y [get_ports {saradc_data[1]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -max -pin Y [get_ports {saradc_data[1]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -max -pin Y [get_ports {saradc_data[1]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -min -pin Y [get_ports {saradc_data[0]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -min -pin Y [get_ports {saradc_data[0]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -rise -max -pin Y [get_ports {saradc_data[0]}]
set_driving_cell -lib_cell INVX1MA10TH -library scadv10_cln65gp_hvt_ss_0p9v_125c -fall -max -pin Y [get_ports {saradc_data[0]}]
set_load -pin_load -max  0.6  [get_ports {a0[31]}]
set_load -pin_load -min  0.6  [get_ports {a0[31]}]
set_load -pin_load -max  0.6  [get_ports {a0[30]}]
set_load -pin_load -min  0.6  [get_ports {a0[30]}]
set_load -pin_load -max  0.6  [get_ports {a0[29]}]
set_load -pin_load -min  0.6  [get_ports {a0[29]}]
set_load -pin_load -max  0.6  [get_ports {a0[28]}]
set_load -pin_load -min  0.6  [get_ports {a0[28]}]
set_load -pin_load -max  0.6  [get_ports {a0[27]}]
set_load -pin_load -min  0.6  [get_ports {a0[27]}]
set_load -pin_load -max  0.6  [get_ports {a0[26]}]
set_load -pin_load -min  0.6  [get_ports {a0[26]}]
set_load -pin_load -max  0.6  [get_ports {a0[25]}]
set_load -pin_load -min  0.6  [get_ports {a0[25]}]
set_load -pin_load -max  0.6  [get_ports {a0[24]}]
set_load -pin_load -min  0.6  [get_ports {a0[24]}]
set_load -pin_load -max  0.6  [get_ports {a0[23]}]
set_load -pin_load -min  0.6  [get_ports {a0[23]}]
set_load -pin_load -max  0.6  [get_ports {a0[22]}]
set_load -pin_load -min  0.6  [get_ports {a0[22]}]
set_load -pin_load -max  0.6  [get_ports {a0[21]}]
set_load -pin_load -min  0.6  [get_ports {a0[21]}]
set_load -pin_load -max  0.6  [get_ports {a0[20]}]
set_load -pin_load -min  0.6  [get_ports {a0[20]}]
set_load -pin_load -max  0.6  [get_ports {a0[19]}]
set_load -pin_load -min  0.6  [get_ports {a0[19]}]
set_load -pin_load -max  0.6  [get_ports {a0[18]}]
set_load -pin_load -min  0.6  [get_ports {a0[18]}]
set_load -pin_load -max  0.6  [get_ports {a0[17]}]
set_load -pin_load -min  0.6  [get_ports {a0[17]}]
set_load -pin_load -max  0.6  [get_ports {a0[16]}]
set_load -pin_load -min  0.6  [get_ports {a0[16]}]
set_load -pin_load -max  0.6  [get_ports {a0[15]}]
set_load -pin_load -min  0.6  [get_ports {a0[15]}]
set_load -pin_load -max  0.6  [get_ports {a0[14]}]
set_load -pin_load -min  0.6  [get_ports {a0[14]}]
set_load -pin_load -max  0.6  [get_ports {a0[13]}]
set_load -pin_load -min  0.6  [get_ports {a0[13]}]
set_load -pin_load -max  0.6  [get_ports {a0[12]}]
set_load -pin_load -min  0.6  [get_ports {a0[12]}]
set_load -pin_load -max  0.6  [get_ports {a0[11]}]
set_load -pin_load -min  0.6  [get_ports {a0[11]}]
set_load -pin_load -max  0.6  [get_ports {a0[10]}]
set_load -pin_load -min  0.6  [get_ports {a0[10]}]
set_load -pin_load -max  0.6  [get_ports {a0[9]}]
set_load -pin_load -min  0.6  [get_ports {a0[9]}]
set_load -pin_load -max  0.6  [get_ports {a0[8]}]
set_load -pin_load -min  0.6  [get_ports {a0[8]}]
set_load -pin_load -max  0.6  [get_ports {a0[7]}]
set_load -pin_load -min  0.6  [get_ports {a0[7]}]
set_load -pin_load -max  0.6  [get_ports {a0[6]}]
set_load -pin_load -min  0.6  [get_ports {a0[6]}]
set_load -pin_load -max  0.6  [get_ports {a0[5]}]
set_load -pin_load -min  0.6  [get_ports {a0[5]}]
set_load -pin_load -max  0.6  [get_ports {a0[4]}]
set_load -pin_load -min  0.6  [get_ports {a0[4]}]
set_load -pin_load -max  0.6  [get_ports {a0[3]}]
set_load -pin_load -min  0.6  [get_ports {a0[3]}]
set_load -pin_load -max  0.6  [get_ports {a0[2]}]
set_load -pin_load -min  0.6  [get_ports {a0[2]}]
set_load -pin_load -max  0.6  [get_ports {a0[1]}]
set_load -pin_load -min  0.6  [get_ports {a0[1]}]
set_load -pin_load -max  0.6  [get_ports {a0[0]}]
set_load -pin_load -min  0.6  [get_ports {a0[0]}]
set_wire_load_mode enclosed
set_max_transition 0.5  [get_designs {MCU}]
set_false_path  -to [get_pins {rom0/PGEN ram0/PGEN ram1/PGEN}] 
set_false_path  -from [get_clocks {clk_sck0 mclk clk_sck1 clk_hfxt smclk clk_scl1 clk_scl0 clk_lfxt}] -to [get_clocks {clk_cpu}]
set_false_path  -from [get_clocks {clk_sck0 mclk clk_sck1 clk_hfxt smclk clk_cpu clk_scl0 clk_lfxt}] -to [get_clocks {clk_scl1}]
set_false_path  -from [get_clocks {clk_sck0 mclk clk_sck1 clk_hfxt smclk clk_scl1 clk_cpu clk_scl0}] -to [get_clocks {clk_lfxt}]
set_false_path  -from [get_clocks {clk_sck0 mclk clk_sck1 smclk clk_scl1 clk_cpu clk_scl0 clk_lfxt}] -to [get_clocks {clk_hfxt}]
set_false_path  -from [get_clocks {clk_sck0 clk_sck1 clk_hfxt smclk clk_scl1 clk_cpu clk_scl0 clk_lfxt}] -to [get_clocks {mclk}]
set_false_path  -from [get_clocks {clk_sck0 mclk clk_sck1 clk_hfxt smclk clk_scl1 clk_cpu clk_lfxt}] -to [get_clocks {clk_scl0}]
set_false_path  -from [get_clocks {clk_sck0 mclk clk_hfxt smclk clk_scl1 clk_cpu clk_scl0 clk_lfxt}] -to [get_clocks {clk_sck1}]
set_false_path  -from [get_clocks {clk_sck0 mclk clk_sck1 clk_hfxt clk_scl1 clk_cpu clk_scl0 clk_lfxt}] -to [get_clocks {smclk}]
set_false_path  -from [get_clocks {mclk clk_sck1 clk_hfxt smclk clk_scl1 clk_cpu clk_scl0 clk_lfxt}] -to [get_clocks {clk_sck0}]
